SM_для_EDT/src/InformationRegisters/рарусГруппыТиповыхОперацийИАналитикДляОтчетов/рарусГруппыТиповыхОперацийИАналитикДляОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусГруппыТиповыхОперацийИАналитикДляОтчетов</name>
  <comment>Задача № 20649</comment>
  <dimensions>
    <name>ТиповыеОперации</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикиПростоя</name>
    <type>
      <types>CatalogRef.рарусАналитикиПростоя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидГруппыТиповыхОперацийИАналитик</name>
    <type>
      <types>EnumRef.рарусВидыГруппТиповыхОперацийИАналитик</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/рарусВидыГруппТиповыхОперацийИАналитик/рарусВидыГруппТиповыхОперацийИАналитик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыГруппТиповыхОперацийИАналитик</name>
  <comment>Задача № 20649</comment>
  <enumValues>
    <name>ДП</name>
  </enumValues>
  <enumValues>
    <name>ДВ</name>
  </enumValues>
  <enumValues>
    <name>Е</name>
  </enumValues>
  <enumValues>
    <name>Ж</name>
  </enumValues>
  <enumValues>
    <name>З</name>
  </enumValues>
  <enumValues>
    <name>И</name>
  </enumValues>
  <enumValues>
    <name>К</name>
  </enumValues>
  <enumValues>
    <name>Л</name>
  </enumValues>
  <enumValues>
    <name>М</name>
  </enumValues>
  <enumValues>
    <name>Н</name>
  </enumValues>
  <enumValues>
    <name>О</name>
  </enumValues>
  <enumValues>
    <name>П</name>
  </enumValues>
  <enumValues>
    <name>Р</name>
  </enumValues>
  <enumValues>
    <name>С</name>
  </enumValues>
  <enumValues>
    <name>Т</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Catalogs/рарусСправочникСсылок/рарусСправочникСсылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусСправочникСсылок</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>FSC</name>
      <description>FSC</description>
    </items>
    <items>
      <name>PSC</name>
      <description>PSC</description>
    </items>
    <items>
      <name>ГПК</name>
      <description>ГПК</description>
    </items>
    <items>
      <name>ДиректоруПоЭксплуатации</name>
      <description>Директор по эксплуатации в родительном падеже</description>
    </items>
    <items>
      <name>ИнтервалМеждуРейсами</name>
      <description>Интервал между рейсами, часы</description>
    </items>
    <items>
      <name>МаслоГД</name>
      <description>Масло ГД</description>
    </items>
    <items>
      <name>МаслоДГ</name>
      <description>Масло ДГ</description>
    </items>
    <items>
      <name>МинКоличествоСтрокАзов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Азов&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокКЕК</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение КЕК&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокЛоцман</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение участков с лоцманом&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокРостов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Ростов&quot;</description>
    </items>
    <items>
      <name>МодельРДО_ННФ</name>
      <description>Модель РДО (Нефтеналивной флот)</description>
    </items>
    <items>
      <name>МодельРДО_СГФ</name>
      <description>Модель РДО (Сухогрузный флот)</description>
    </items>
    <items>
      <name>МодельРДО_СЗП</name>
      <description>Модель РДО (Морской сухогрузный флот)</description>
    </items>
    <items>
      <name>РМРС</name>
      <description>РМРС</description>
    </items>
    <items>
      <name>ТопливоМТ01</name>
      <description>МТ 0.1</description>
    </items>
    <items>
      <name>ТопливоМТ05</name>
      <description>МТ 0.5</description>
    </items>
    <items>
      <name>ТопливоМТ15</name>
      <description>МТ 1.5</description>
    </items>
    <items>
      <name>ТопливоСМТ</name>
      <description>СМТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
      <types>CatalogRef.Номенклатура</types>
      <types>String</types>
      <types>CatalogRef.vftПунктыСледования</types>
      <types>Number</types>
      <types>CatalogRef.рарусУчасткиСОЛП</types>
      <types>CatalogRef.впМодельРДО</types>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftТиповыеОперации/vftТиповыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftТиповыеОперации</name>
  <predefined>
    <items>
      <name>Бункеровка</name>
      <description>Бункеровка (Л)</description>
    </items>
    <items>
      <name>Выгрузка</name>
      <description>Выгрузка (Ж)</description>
    </items>
    <items>
      <name>ПаузкаДогрузка</name>
      <description>Догрузка</description>
    </items>
    <items>
      <name>Маневры</name>
      <description>Маневры в пункте</description>
    </items>
    <items>
      <name>МаневрыНаПереходе</name>
      <description>Маневры на переходе - КВК, СПБ (З)</description>
    </items>
    <items>
      <name>МетеорологическиеПричины</name>
      <description>Метеорологические причины (И)</description>
    </items>
    <items>
      <name>НачалоРейса</name>
      <description>Начало рейса</description>
    </items>
    <items>
      <name>ОжиданиеВыгрузки</name>
      <description>Ожидание выгрузки (Д)</description>
    </items>
    <items>
      <name>ОжиданиеДогрузки</name>
      <description>Ожидание догрузки</description>
    </items>
    <items>
      <name>ФормированиеСостава</name>
      <description>Ожидание и формирование состава</description>
    </items>
    <items>
      <name>ОжиданиеОформленияОтхода</name>
      <description>Ожидание оформления отхода (Н)</description>
    </items>
    <items>
      <name>ОжиданиеОформленияПрихода</name>
      <description>Ожидание оформления прихода (Н)</description>
    </items>
    <items>
      <name>ОжиданиеПаузки</name>
      <description>Ожидание паузки (С)</description>
    </items>
    <items>
      <name>ОжиданиеПогрузки</name>
      <description>Ожидание погрузки (Д)</description>
    </items>
    <items>
      <name>ОжиданиеРазводкиМостов</name>
      <description>Ожидание разводки мостов</description>
    </items>
    <items>
      <name>РазрешениеНаДвижение</name>
      <description>Ожидание разрешения на движение (Р)</description>
    </items>
    <items>
      <name>ОжиданиеЭкипажа</name>
      <description>Ожидание экипажа (М)</description>
    </items>
    <items>
      <name>ПаузкаВыгрузка</name>
      <description>Паузка (Т)</description>
    </items>
    <items>
      <name>Перевалка</name>
      <description>Перевалка (Е)</description>
    </items>
    <items>
      <name>ПередачаТоплива</name>
      <description>Передача топлива (Л)</description>
    </items>
    <items>
      <name>Погрузка</name>
      <description>Погрузка (Е)</description>
    </items>
    <items>
      <name>ПромежуточныйПункт</name>
      <description>Промежуточный пункт</description>
    </items>
    <items>
      <name>Ремонт</name>
      <description>Ремонт (К)</description>
    </items>
    <items>
      <name>Шлюзование</name>
      <description>Шлюзование</description>
    </items>
  </predefined>
  <attributes>
    <name>Стоянка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаСтоянка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПослеСтоянки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧистыеГрузовыеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаОтчета</name>
    <type>
      <types>EnumRef.vftГруппыСтоянокПутевогоЖурнала</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВПутевомЖурнале</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТолькоСАналитикой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияДляРДО</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазделениеПоМоделямРДО</name>
    <attributes>
      <name>МодельРДО</name>
      <type>
        <types>CatalogRef.впМодельРДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидимостьВПЖ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидимостьВРДО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/CommonModules/рарусОтчеты/Module.bsl
#Область РейсовыйиТопливныйОтчет

Функция ПолучитьПредставлениеТопливо(Документ, Пар) Экспорт
	
	Врем = Документ.Бункеровки.Выгрузить();
	Врем.Свернуть("ДатаБункеровки, ВидТоплива", "Количество");
	
	Если Пар = "Н" Тогда
		Врем = Врем.НайтиСтроки(новый Структура("ДатаБункеровки", '19000101'));
	ИначеЕсли Пар = "Р" Тогда
		Врем = Врем.НайтиСтроки(новый Структура("ДатаБункеровки", '39991215'));
	ИначеЕсли Пар = "К" Тогда
		Врем = Врем.НайтиСтроки(новый Структура("ДатаБункеровки", '39991220'));
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если Врем.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТопливоСМТКол = 0;
	ТопливоМТ01Кол = 0;
	ТопливоМТ05Кол = 0;
	ТопливоМТ15Кол = 0;
	МаслоГДКол = 0;
	МаслоДГКол = 0;
	// ++ rarus Камаев П.В. 02.10.2020 Задача № 24505
	МаслоКол = 0;
	
	Для каждого ВремСтрока Из Врем Цикл
		
		Если ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.МаслоГД.Значение Тогда
			МаслоГДКол = ВремСтрока.Количество;
			МаслоКол = МаслоКол + МаслоГДКол;
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоМТ01.Значение Тогда
			ТопливоМТ01Кол = ВремСтрока.Количество;
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоМТ05.Значение Тогда
			ТопливоМТ05Кол = ВремСтрока.Количество;
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоМТ15.Значение Тогда
			ТопливоМТ15Кол = ВремСтрока.Количество;
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоСМТ.Значение Тогда
			ТопливоСМТКол = ВремСтрока.Количество;
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.МаслоДГ.Значение Тогда
			МаслоДГКол = ВремСтрока.Количество;
			МаслоКол = МаслоКол + МаслоДГКол;
		КонецЕсли;
	
	КонецЦикла;
	
	Проект = Документ.Судно.Проект;
	МассивВидовТоплива = ПолучитьМассивВидовТопливаПоПроекту(Проект);

	ПредставлениеТопливо = "";
	Для каждого ЭлементМассива Из МассивВидовТоплива Цикл
		Если ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоСМТ Тогда
			ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + Формат(ТопливоСМТКол,"ЧДЦ=3; ЧН=; ЧГ=0");	
			
		ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоМТ01 Тогда
			ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + Формат(ТопливоМТ01Кол,"ЧДЦ=3; ЧН=; ЧГ=0");
			
		ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоМТ05 Тогда
			ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + Формат(ТопливоМТ05Кол,"ЧДЦ=3; ЧН=; ЧГ=0");
			
		ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоМТ15 Тогда
			ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + Формат(ТопливоМТ15Кол,"ЧДЦ=3; ЧН=; ЧГ=0");
			
		ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.МаслоГД Тогда
			ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + Формат(МаслоГДКол,"ЧДЦ=1; ЧН=; ЧГ=0");
			
		ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.МаслоДГ Тогда
			ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + Формат(МаслоДГКол,"ЧДЦ=1; ЧН=; ЧГ=0");
			
		ИначеЕсли ЭлементМассива = "Масло" Тогда
			ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + Формат(МаслоКол,"ЧДЦ=1; ЧН=; ЧГ=0");
		КонецЕсли;
	КонецЦикла;
	
	
	Возврат ПредставлениеТопливо;
	// -- rarus Камаев П.В. 02.10.2020
	
КонецФункции

Процедура ВывестиСтрокуРейсовогоОтчета(Таб,Макет,Номер = "",Буква = "",Значение = "",Описание = "") Экспорт
	
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.Номер = Номер;
	Область.Параметры.Буква = Буква;
	Область.Параметры.Значение = Значение;
	Область.Параметры.Описание = Описание;
	Таб.Вывести(Область);
	
КонецПроцедуры

Функция ПолучитьПредставлениеБункеровки(Документ) Экспорт
	
	// Получаем данные по бункеровкам
	Врем = Документ.Бункеровки.Выгрузить();
	рарусОбщегоНазначенияКлиентСервер.УдалитьСтрокиТЗ(Врем,Новый Структура("Операция",Справочники.vftТиповыеОперации.ПустаяСсылка()));
	Врем.Свернуть("ДатаБункеровки,Операция,Бункеровщик,ВидТоплива","Количество");
	Врем.Сортировать("ДатаБункеровки");
	Врем.Колонки.Добавить("ТопливоСМТКол",Новый ОписаниеТипов("Число"));
	Врем.Колонки.Добавить("ТопливоМТ01Кол",Новый ОписаниеТипов("Число"));
	Врем.Колонки.Добавить("ТопливоМТ05Кол",Новый ОписаниеТипов("Число"));
	Врем.Колонки.Добавить("ТопливоМТ15Кол",Новый ОписаниеТипов("Число"));
	Врем.Колонки.Добавить("МаслоГДКол",Новый ОписаниеТипов("Число"));
	Врем.Колонки.Добавить("МаслоДГКол",Новый ОписаниеТипов("Число"));
	// ++ rarus Камаев П.В. 02.10.2020 Задача № 24505
	Врем.Колонки.Добавить("МаслоКол",Новый ОписаниеТипов("Число"));

	Проект = Документ.Судно.Проект;
		
	Для каждого ВремСтрока Из Врем Цикл
		
		Если ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоСМТ.Значение Тогда
			ВремСтрока.ТопливоСМТКол = ВремСтрока.Количество;
			
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоМТ01.Значение Тогда
			ВремСтрока.ТопливоМТ01Кол = ВремСтрока.Количество;
			
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоМТ05.Значение Тогда
			ВремСтрока.ТопливоМТ05Кол = ВремСтрока.Количество;
			
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.ТопливоМТ15.Значение Тогда
			ВремСтрока.ТопливоМТ15Кол = ВремСтрока.Количество;
			
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.МаслоГД.Значение Тогда
			ВремСтрока.МаслоГДКол	= ВремСтрока.Количество;
			ВремСтрока.МаслоКол		= ВремСтрока.Количество;
			
		ИначеЕсли ВремСтрока.ВидТоплива = Справочники.рарусСправочникСсылок.МаслоДГ.Значение Тогда
			ВремСтрока.МаслоДГКол	= ВремСтрока.Количество;
			ВремСтрока.МаслоКол		= ВремСтрока.Количество;
		КонецЕсли;
	
	КонецЦикла;
	Врем.Свернуть("ДатаБункеровки,Операция,Бункеровщик","ТопливоСМТКол,ТопливоМТ01Кол,ТопливоМТ05Кол,ТопливоМТ15Кол,МаслоГДКол,МаслоДГКол,МаслоКол");
	Врем.Сортировать("ДатаБункеровки");
	// Дополнительные колонки
	Врем.Колонки.Добавить("ЭтоПерваяСтрока",Новый ОписаниеТипов("Булево"));
	Врем.Колонки.Добавить("Значение",Новый ОписаниеТипов("Строка"));
	Врем.Колонки.Добавить("Описание",Новый ОписаниеТипов("Строка"));
	
	// Если данных нет
	Если Врем.Количество() = 0 Тогда
		Стр = Врем.Добавить();
		Стр.ЭтоПерваяСтрока = Истина;
		Стр.Значение = "НЕТ";
		Стр.Описание = "Дата / Операция / Бункеровщик /  " + ПолучитьПредставлениеТопливоШапка(Проект);
		Возврат Врем;
	КонецЕсли;
	
	// Заполняем представление
	Врем[0].ЭтоПерваяСтрока = Истина;
	Врем[0].Описание = "Дата / Операция / Бункеровщик /  " + ПолучитьПредставлениеТопливоШапка(Проект);
	
	МассивВидовТоплива = ПолучитьМассивВидовТопливаПоПроекту(Проект);
	
	Для Каждого Стр из Врем Цикл
		Стр.Значение = Формат(Стр.ДатаБункеровки,"ДФ = dd.MM.yyyy") + " / " + Стр.Операция + " / " + Стр.Бункеровщик; 
		Для каждого ЭлементМассива Из МассивВидовТоплива Цикл
			Если ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоСМТ Тогда
				Стр.Значение = Стр.Значение + " / " + Формат(Стр.ТопливоСМТКол,"ЧДЦ=3; ЧН=; ЧГ=0");	
				
			ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоМТ01 Тогда
				Стр.Значение = Стр.Значение + " / " + Формат(Стр.ТопливоМТ01Кол,"ЧДЦ=3; ЧН=; ЧГ=0");
				
			ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоМТ05 Тогда
				Стр.Значение = Стр.Значение + " / " + Формат(Стр.ТопливоМТ05Кол,"ЧДЦ=3; ЧН=; ЧГ=0");
				
			ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.ТопливоМТ15 Тогда
				Стр.Значение = Стр.Значение + " / " + Формат(Стр.ТопливоМТ15Кол,"ЧДЦ=3; ЧН=; ЧГ=0");
				
			ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.МаслоГД Тогда
				Стр.Значение = Стр.Значение + " / " + Формат(Стр.МаслоГДКол,"ЧДЦ=1; ЧН=; ЧГ=0");
				
			ИначеЕсли ЭлементМассива = Справочники.рарусСправочникСсылок.МаслоДГ Тогда
				Стр.Значение = Стр.Значение + " / " + Формат(Стр.МаслоДГКол,"ЧДЦ=1; ЧН=; ЧГ=0");
				
			ИначеЕсли ЭлементМассива = "Масло" Тогда
				Стр.Значение = Стр.Значение + " / " + Формат(Стр.МаслоКол,"ЧДЦ=1; ЧН=; ЧГ=0");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	// -- rarus Камаев П.В. 02.10.2020
	
	Возврат Врем;
	
КонецФункции

Функция ПолучитьПредставлениеГрузы(Документ) Экспорт
	
	Перем ТЗ,СтрТЗ;
	
	ТЗ = ПолучитьТаблицуГрузов(Документ);
	ЭтоТолкач = Документ.Судно.Проект.Толкач;
	// Подготовка данных для рейсового отчета
	Если ЭтоТолкач Тогда
		ТЗ.Свернуть("ДатаВыпускаКоносамента,Груз,БаржаПриход","ВесГруза");
		ТЗ.Сортировать("ДатаВыпускаКоносамента,Груз,БаржаПриход");
	Иначе
		ТЗ.Свернуть("ДатаВыпускаКоносамента,Груз","ВесГруза");
		ТЗ.Сортировать("ДатаВыпускаКоносамента,Груз");
	КонецЕсли;
	
	// Добавляем дополнительные колонки
	ТЗ.Колонки.Добавить("ЭтоПерваяСтрока",Новый ОписаниеТипов("Булево"));
	ТЗ.Колонки.Добавить("Значение",Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Описание",Новый ОписаниеТипов("Строка"));
	
	// Если данных нет
	Если ТЗ.Количество() = 0 Тогда
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.ЭтоПерваяСтрока = Истина;
		СтрТЗ.Значение = "НЕТ";
		Если ЭтоТолкач Тогда
			СтрТЗ.Описание = "Дата выпуска коносамента / номер секции / наименование груза / количество, т";
		Иначе
			СтрТЗ.Описание = "Дата выпуска коносамента / наименование груза / количество, т";
		КонецЕсли;
		Возврат ТЗ;
	КонецЕсли;
	
	// Заполняем представление
	ТЗ[0].ЭтоПерваяСтрока = Истина;
	
	Если ЭтоТолкач Тогда
		ТЗ[0].Описание = "Дата выпуска коносамента / номер секции / наименование груза / количество, т";
		Для Каждого СтрТЗ из ТЗ Цикл
			СтрТЗ.Значение = Формат(СтрТЗ.ДатаВыпускаКоносамента,"ДФ = dd.MM.yyyy; ДП = '<не указано>'") + " / " + СтрТЗ.БаржаПриход + " / " + СтрТЗ.Груз + " / " + Формат(СтрТЗ.ВесГруза,"ЧДЦ = 3; ЧН = ; ЧГ = 0");
		КонецЦикла;
	Иначе
		ТЗ[0].Описание = "Дата выпуска коносамента / наименование груза / количество, т";
		Для Каждого СтрТЗ из ТЗ Цикл
			СтрТЗ.Значение = Формат(СтрТЗ.ДатаВыпускаКоносамента,"ДФ = dd.MM.yyyy; ДП = '<не указано>'") + " / " + СтрТЗ.Груз + " / " + Формат(СтрТЗ.ВесГруза,"ЧДЦ = 3; ЧН = ; ЧГ = 0");
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьТаблицуГрузов(Документ) Экспорт
	
	// Причины, у которых возможно получение груза
	СписокПричин = Новый Массив;
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.НачалоРейса);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.ФормированиеСостава);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.Маневры);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.МаневрыНаПереходе);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.Погрузка);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.Перевалка);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.ОжиданиеВыгрузки);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.ОжиданиеДогрузки);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.ОжиданиеПаузки);
	СписокПричин.Добавить(Справочники.vftТиповыеОперации.ОжиданиеПогрузки);
	
	// Строки ТЧ "Пункты" с указанными причинами
	СписокИД = Новый Массив;
	
	Для Каждого СтрП из Документ.Пункты Цикл
		Если СписокПричин.Найти(СтрП.ПричинаСтоянки)<>Неопределено Тогда
			СписокИД.Добавить(СтрП.ИД);
		КонецЕсли;
	КонецЦикла;
	
	// Отбираем строки из ТЧ "Баржи"
	ТЗ = Документ.Баржи.ВыгрузитьКолонки("БаржаПриход,Груз,ВесГруза,ДатаВыпускаКоносамента");
	
	Для Каждого СтрБ из Документ.Баржи Цикл
		Если СтрБ.ВесГруза<>0 и не СтрБ.ВесГрузаМетка и СписокИД.Найти(СтрБ.ИД)<>Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТЗ.Добавить(),СтрБ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

// ++ rarus Камаев П.В. 02.10.2020 Задача № 24505
Функция ПолучитьПредставлениеТопливоШапка(Проект) Экспорт
	
	Соответствие = новый Соответствие;
	Соответствие.Вставить(Справочники.рарусСправочникСсылок.ТопливоСМТ, "СМТ, т");
	Соответствие.Вставить(Справочники.рарусСправочникСсылок.ТопливоМТ01, "МТ 0.1, т");
	Соответствие.Вставить(Справочники.рарусСправочникСсылок.ТопливоМТ05, "МТ 0.5, т");
	Соответствие.Вставить(Справочники.рарусСправочникСсылок.ТопливоМТ15, "МТ 1.5, т");
	Соответствие.Вставить(Справочники.рарусСправочникСсылок.МаслоГД, "Масло ГД, кг");
	Соответствие.Вставить(Справочники.рарусСправочникСсылок.МаслоДГ, "Масло ДГ, кг");
	Соответствие.Вставить("Масло", "Масло ГД+ДГ, кг");
	
	МассивВидовТоплива = ПолучитьМассивВидовТопливаПоПроекту(Проект);
	
	ПредставлениеТопливо = "";
	
	Для Каждого ЭлементМассива ИЗ МассивВидовТоплива Цикл
		ТекПредставлениеТопливо = Соответствие.Получить(ЭлементМассива);
		ПредставлениеТопливо = ПредставлениеТопливо + ?(ЗначениеЗаполнено(ПредставлениеТопливо), " / ", "") + ТекПредставлениеТопливо;	
	КонецЦикла;
	
	Возврат ПредставлениеТопливо
	
КонецФункции

Функция ПолучитьМассивВидовТопливаПоПроекту(Проект) Экспорт
	
	Массив = новый Массив;
	
	Если Проект.ШаблонДляТопливныхОтчетов.Количество() Тогда
		ТЗ = Проект.ШаблонДляТопливныхОтчетов.Выгрузить();
		Массив = ТЗ.ВыгрузитьКолонку("ВидТоплива");
	Иначе
		Массив.Добавить(Справочники.рарусСправочникСсылок.ТопливоСМТ);
		Массив.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ01);
		Массив.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ05);
		Массив.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ15);
		Массив.Добавить(Справочники.рарусСправочникСсылок.МаслоГД);
		Массив.Добавить(Справочники.рарусСправочникСсылок.МаслоДГ);
	КонецЕсли;
	
	Возврат Массив
	
КонецФункции
// -- rarus Камаев П.В. 02.10.2020

Функция ПолучитьТЗТиповыхОперацийиАналитик() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	рарусГруппыТиповыхОперацийИАналитикДляОтчетов.ТиповыеОперации КАК ТиповаяОперация,
	|	рарусГруппыТиповыхОперацийИАналитикДляОтчетов.АналитикиПростоя КАК Аналитика,
	|	рарусГруппыТиповыхОперацийИАналитикДляОтчетов.ВидГруппыТиповыхОперацийИАналитик КАК Группа
	|ИЗ
	|	РегистрСведений.рарусГруппыТиповыхОперацийИАналитикДляОтчетов КАК рарусГруппыТиповыхОперацийИАналитикДляОтчетов";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция УсловиеВыполнено(ТЗТиповыхОперацийиАналитик, Представление, ТиповаяОперация, Аналитика) Экспорт
	
	Попытка
		Группа = Перечисления.рарусВидыГруппТиповыхОперацийИАналитик[Представление];
	Исключение
		Возврат Ложь
	КонецПопытки;
	
	Отбор = новый Структура("Группа, ТиповаяОперация, Аналитика", Группа, ТиповаяОперация, Аналитика);
	НайденныеСтроки = ТЗТиповыхОперацийиАналитик.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивРеквизитов(ВидОбъекта, НаименованиеОбъекта) Экспорт
	
	МассивМета = новый Массив;
	
	Для каждого Реквизит Из Метаданные[ВидОбъекта][НаименованиеОбъекта].Реквизиты Цикл
		МассивМета.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат МассивМета
			
КонецФункции

Функция ПолучитьКонДатуОформленияДокументов(Дата, Судно) Экспорт
	
	// Строка 01: выгрузка, кон. дата оформления документов предыдущего рейса
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",	НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонДата",	Дата - 1);
	Запрос.УстановитьПараметр("Судно",		Судно);
	Запрос.УстановитьПараметр("Выгрузка",	Справочники.vftТиповыеОперации.Выгрузка);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Рейс.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПредыдущийРейс
	|ИЗ
	|	Документ.vftРейс КАК Рейс
	|ГДЕ
	|	Рейс.Дата МЕЖДУ &НачДата И &КонДата
	|	И НЕ Рейс.ПометкаУдаления
	|	И Рейс.Судно = &Судно
	|
	|УПОРЯДОЧИТЬ ПО
	|	Рейс.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсПункты.ИД КАК ИД,
	|	РейсПункты.ПричинаСтоянки КАК ПричинаСтоянки
	|ПОМЕСТИТЬ РейсПункты
	|ИЗ
	|	Документ.vftРейс.Пункты КАК РейсПункты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредыдущийРейс КАК ПредыдущийРейс
	|		ПО РейсПункты.Ссылка = ПредыдущийРейс.Ссылка
	|ГДЕ
	|	РейсПункты.ПричинаСтоянки = &Выгрузка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсБаржи.ИД КАК ИД,
	|	РейсБаржи.ДокументыНаБортуКонДата КАК ДокументыНаБортуКонДата
	|ПОМЕСТИТЬ РейсБаржи
	|ИЗ
	|	Документ.vftРейс.Баржи КАК РейсБаржи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредыдущийРейс КАК ПредыдущийРейс
	|		ПО РейсБаржи.Ссылка = ПредыдущийРейс.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РейсБаржи.ДокументыНаБортуКонДата) КАК ДокументыНаБортуКонДата
	|ИЗ
	|	РейсБаржи КАК РейсБаржи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РейсПункты КАК РейсПункты
	|		ПО РейсБаржи.ИД = РейсПункты.ИД";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументыНаБортуКонДата;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
